In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("home_prices2.csv")
df

   area    price    city
0   200  2000000  mumbai
1   200  1000000  nagpur
2   300  2000000    pune
3   500  5200000  mumbai
4   300  1600000  nagpur
5   550  5600000  mumbai

In [3]:
city_dummies=pd.get_dummies(df.city)
city_dummies

   mumbai  nagpur  pune
0       1       0     0
1       0       1     0
2       0       0     1
3       1       0     0
4       0       1     0
5       1       0     0

In [4]:
df.drop("city",axis=1,inplace=True)

In [5]:
df=pd.concat([df,city_dummies],axis="columns")
df.drop("pune",axis="columns",inplace=True)

In [6]:
X=df.drop("price",axis=1)

In [7]:
Y=df.price

In [8]:
X.head()

   area  mumbai  nagpur
0   200       1       0
1   200       0       1
2   300       0       0
3   500       1       0
4   300       0       1

In [9]:
Y.head()

0    2000000
1    1000000
2    2000000
3    5200000
4    1600000
Name: price, dtype: int64

In [10]:
from sklearn.linear_model import LinearRegression

In [11]:
model=LinearRegression()

In [12]:
model.fit(X,Y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [16]:
model.predict([[300,0,0]])

array([2000000.])